#include "CPeLoader.h"
#include <stdlib.h>
#include <atlstr.h>
#include <algorithm>
#include <string>
#include "CVmCpuEmulation.h"
#include "CMemManager.h"
#include "CVmcpu.h"

#define IMPORT_NUM_DEFAULT_NAME L"NumImport..!!"
#define IMPORT_FUNCTION_NUM_FLAGS 0xEFFFFFFFFFFFFFFF
#define IMAGE_ORDINAL_FLAG64 0x8000000000000000
#define IMAGE_ORDINAL_FLAG32 0x80000000
#define IMAGE_ORDINAL64(Ordinal) (Ordinal & 0xffff)
#define IMAGE_ORDINAL32(Ordinal) (Ordinal & 0xffff)
#define IMAGE_SNAP_BY_ORDINAL64(Ordinal) ((Ordinal & IMAGE_ORDINAL_FLAG64) != 0)
#define IMAGE_SNAP_BY_ORDINAL32(Ordinal) ((Ordinal & IMAGE_ORDINAL_FLAG32) != 0)

#define BITS_NT_HEADER_OPTION(BITS, NTHEADER, OPTION_FIELD_NAME) (BITS == BIT_TYPE_32 ? ((PIMAGE_NT_HEADERS32)NTHEADER)->OptionalHeader.OPTION_FIELD_NAME : ((PIMAGE_NT_HEADERS64)NTHEADER)->OptionalHeader.OPTION_FIELD_NAME)

#define LOAD_SYSTEM_DLL_COUNT 4
static const WCHAR *g_wsLoaddll[LOAD_SYSTEM_DLL_COUNT] = { L"ntdll.dll", L"kernel32.dll" , L"kernelbase.dll", L"user32.dll"};

CPELoader::CPELoader() : m_ApiSetData(NULL), m_dwApiSetDataSize(0)
{
	m_ApiSetData = GetApiSetData(&m_dwApiSetDataSize);
}

CPELoader::~CPELoader()
{
	if (m_ApiSetData)
	{
		free(m_ApiSetData);
		m_ApiSetData = NULL;
		m_dwApiSetDataSize = 0;
	}
}




int CPELoader::PeloaderCheckNtHeader(IMAGE_NT_HEADERS *pNtheader)
{
	WORD attr = 0;
	
	/* Validate the "PE\0\0" signature */
	if (pNtheader->Signature != IMAGE_NT_SIGNATURE) 
	{
		return -EINVAL;
	}

	PIMAGE_DATA_DIRECTORY pDirTmp = bits == BIT_TYPE_32 ? &((PIMAGE_NT_HEADERS32)pNTHeader)->OptionalHeader.DataDirectory[IMAGE_DIRECTORY_ENTRY_LOAD_CONFIG] :
									   &((PIMAGE_NT_HEADERS64)pNTHeader)->OptionalHeader.DataDirectory[IMAGE_DIRECTORY_ENTRY_LOAD_CONFIG];
	if (pDirTmp->VirtualAddress == 0 || pDirTmp->Size == 0)
	{
		return true;
	}
	PVOID pTmp = (PVOID)((BYTE *)pImageBase + pDirTmp->VirtualAddress);
	if ((ULONGLONG)pTmp >= (ULONGLONG)pImageBase + dwsize)
	{
		return false;
	}

	if (bits == BIT_TYPE_32)
	{
		pConfigDir32 = (PIMAGE_LOAD_CONFIG_DIRECTORY32)pTmp;
		SecurityCookieRva = pConfigDir32->SecurityCookie - (ULONGLONG)FileImageBase;
		SecurityCookieValue = (ULONGLONG)*(ULONG *)((PBYTE)pImageBase + (ULONG)SecurityCookieRva);
	}
	else
	{
		pConfigDir64 = (PIMAGE_LOAD_CONFIG_DIRECTORY64)pTmp;
		SecurityCookieRva = pConfigDir64->SecurityCookie - (ULONGLONG)FileImageBase;
		SecurityCookieValue = *(ULONGLONG *)((PBYTE)pImageBase + (ULONG)SecurityCookieRva);
	}
	SecurityCookieValueOld = SecurityCookieValue;

	do 
	{
		SecurityCookieValue = GetRandomUlonglong();
		SecurityCookieValue &= ~0x0FFFFull;
		if (bits == BIT_TYPE_32)
		{
			SecurityCookieValue &= 0x0FFFFFFFFull;
		}
	} while (SecurityCookieValue == SecurityCookieValueOld);

	pVmCpu->VmWriteMemory(ullVmImageBase + SecurityCookieRva, &SecurityCookieValue, bits == BIT_TYPE_32 ? sizeof(DWORD) : sizeof(ULONGLONG));

	return true;
}

PVOID CPELoader::GetApiSetData(DWORD *dwRetSize)
{
	if (m_ApiSetData && m_dwApiSetDataSize > 0)
	{
		PVOID pRet = malloc(m_dwApiSetDataSize + 2);
		if (!pRet)
		{
			return NULL;
		}
		memcpy(pRet, m_ApiSetData, m_dwApiSetDataSize);
		if (dwRetSize)
		{
			*dwRetSize = m_dwApiSetDataSize;
		}
		return pRet;
	}
	ULONGLONG ulFizeSize = 0;
	PVOID pBase = LoadImageFile(L"c:/windows/system32/apisetschema.dll", &ulFizeSize);
	if (pBase == NULL)
	{
		return NULL;
	}

	PIMAGE_NT_HEADERS pNTHeader = NULL;
	PIMAGE_SECTION_HEADER pSectionHeader = NULL;

	if (!GetPeHeadInfo(pBase, &pNTHeader, &pSectionHeader))
	{
		UnmapViewOfFile(pBase);
		return NULL;
	}

	DWORD dwSections = pNTHeader->FileHeader.NumberOfSections;
	for (WORD i = 0; i < dwSections; i++)
	{
		if (pSectionHeader[i].VirtualAddress == 0 || pSectionHeader[i].SizeOfRawData == 0)
		{
			continue;
		}
		if (strcmp((const char *)pSectionHeader[i].Name, ".apiset") == 0)
		{
			PVOID pRet = malloc(pSectionHeader[i].SizeOfRawData + 2);
			if (!pRet)
			{
				UnmapViewOfFile(pBase);
				return NULL;
			}
			memcpy(pRet, (PVOID)((char *)pBase + pSectionHeader[i].PointerToRawData), pSectionHeader[i].SizeOfRawData);
			if (dwRetSize)
			{
				*dwRetSize = pSectionHeader[i].SizeOfRawData;
			}
			UnmapViewOfFile(pBase);
			return pRet;
		}
	}

	UnmapViewOfFile(pBase);
	return NULL;
}







#define APISETAPI NTAPI

#define API_SET_SCHEMA_VERSION_V2       0x00000002
#define API_SET_SCHEMA_VERSION_V3       0x00000003 // No offline support.
#define API_SET_SCHEMA_VERSION_V4       0x00000004
#define API_SET_SCHEMA_VERSION_V6       0x00000006

typedef struct _API_SET_NAMESPACE {
	ULONG Version;
} API_SET_NAMESPACE, *PAPI_SET_NAMESPACE;


// API set schema version 6.
typedef struct _API_SET_NAMESPACE_V6 {
	ULONG Version;
	ULONG Size;
	ULONG Flags;
	ULONG Count;
	ULONG EntryOffset;  // API_SET_NAMESPACE_ENTRY_V6
	ULONG HashOffset;   // API_SET_NAMESPACE_HASH_ENTRY_V6
	ULONG HashFactor;
} API_SET_NAMESPACE_V6, *PAPI_SET_NAMESPACE_V6;

typedef struct _API_SET_NAMESPACE_ENTRY_V6 {
	ULONG Flags;
	ULONG NameOffset;
	ULONG NameLength;
	ULONG HashedLength;
	ULONG ValueOffset;
	ULONG ValueCount;
} API_SET_NAMESPACE_ENTRY_V6, *PAPI_SET_NAMESPACE_ENTRY_V6;

typedef struct _API_SET_HASH_ENTRY_V6 {
	ULONG Hash;
	ULONG Index;
} API_SET_HASH_ENTRY_V6, *PAPI_SET_HASH_ENTRY_V6;

typedef struct _API_SET_VALUE_ENTRY_V6 {
	ULONG Flags;
	ULONG NameOffset;
	ULONG NameLength;
	ULONG ValueOffset;
	ULONG ValueLength;
} API_SET_VALUE_ENTRY_V6, *PAPI_SET_VALUE_ENTRY_V6;




// API set schema version 4.
typedef struct _API_SET_VALUE_ENTRY_V4 {
	ULONG Flags;        // 0x00
	ULONG NameOffset;   // 0x04
	ULONG NameLength;   // 0x08
	ULONG ValueOffset;  // 0x0C
	ULONG ValueLength;  // 0x10
} API_SET_VALUE_ENTRY_V4, *PAPI_SET_VALUE_ENTRY_V4;

typedef struct _API_SET_VALUE_ARRAY_V4 {
	ULONG Flags;        // 0x00
	ULONG Count;        // 0x04
	API_SET_VALUE_ENTRY_V4 Array[ANYSIZE_ARRAY];
} API_SET_VALUE_ARRAY_V4, *PAPI_SET_VALUE_ARRAY_V4;

typedef struct _API_SET_NAMESPACE_ENTRY_V4 {
	ULONG Flags;
	ULONG NameOffset;
	ULONG NameLength;
	ULONG AliasOffset;
	ULONG AliasLength;
	ULONG DataOffset;   // API_SET_VALUE_ARRAY_V4
} API_SET_NAMESPACE_ENTRY_V4, *PAPI_SET_NAMESPACE_ENTRY_V4;

typedef struct _API_SET_NAMESPACE_ARRAY_V4 {
	ULONG Version;      // 0x00
	ULONG Size;         // 0x04
	ULONG Flags;        // 0x08
	ULONG Count;        // 0x0C
	API_SET_NAMESPACE_ENTRY_V4 Array[ANYSIZE_ARRAY];
} API_SET_NAMESPACE_ARRAY_V4, *PAPI_SET_NAMESPACE_ARRAY_V4;

#define API_SET_SCHEMA_FLAGS_SEALED              0x00000001
#define API_SET_SCHEMA_FLAGS_HOST_EXTENSION      0x00000002
#define API_SET_SCHEMA_ENTRY_FLAGS_SEALED        0x00000001
#define API_SET_SCHEMA_ENTRY_FLAGS_EXTENSION     0x00000002



// API set schema version 3.
typedef struct _API_SET_VALUE_ENTRY_V3 {
	ULONG NameOffset;
	ULONG NameLength;
	ULONG ValueOffset;
	ULONG ValueLength;
} API_SET_VALUE_ENTRY_V3, *PAPI_SET_VALUE_ENTRY_V3;

typedef struct _API_SET_VALUE_ARRAY_V3 {
	ULONG Count;
	API_SET_VALUE_ENTRY_V3 Array[ANYSIZE_ARRAY];
} API_SET_VALUE_ARRAY_V3, *PAPI_SET_VALUE_ARRAY_V3;

typedef struct _API_SET_NAMESPACE_ENTRY_V3 {
	ULONG NameOffset;
	ULONG NameLength;
	ULONG DataOffset;   // API_SET_VALUE_ARRAY_V3
} API_SET_NAMESPACE_ENTRY_V3, *PAPI_SET_NAMESPACE_ENTRY_V3;

typedef struct _API_SET_NAMESPACE_ARRAY_V3 {
	ULONG Version;
